Reports/ОтчетПоАвто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОтчетПоАвто</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ВъездВыездАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВъездВыездАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвтоНаТерритории</xr:Item>
				<xr:Item>AccumulationRegister.АвтоКомпанииНаТерритории</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчетПоАвто/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ТД.Очистить();
	Макет=Отчеты.ОтчетПоАвто.ПолучитьМакет("Макет");
	Шапка=Макет.ПолучитьОбласть("Шапка");
	Стр=Макет.ПолучитьОбласть("Стр");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВъездВыездАвтомобилей.Дата,
	|	ВъездВыездАвтомобилей.Кому,
	|	ВъездВыездАвтомобилей.Поставщик,
	|	ВъездВыездАвтомобилей.Жетон,
	|	ВъездВыездАвтомобилей.МаркаАвтомобиля,
	|	ВъездВыездАвтомобилей.ДатаВремяВъезда,
	|	ВъездВыездАвтомобилей.ДатаВремяВыезда
	|ИЗ
	|	Документ.ВъездВыездАвтомобилей КАК ВъездВыездАвтомобилей
	|ГДЕ
	|	ВъездВыездАвтомобилей.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Отчет.Дата)-8*60*60 );
	Запрос.УстановитьПараметр("Дата2",КонецДня(Отчет.Дата)+8*60*60 );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Шапка.Параметры.Дата=Отчет.Дата;
	ТД.Вывести(Шапка);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Жетон) тогда
			
			Стр.Параметры.Подразделение=Выборка.Кому;
			Стр.Параметры.Поставщик=Выборка.Поставщик;
			Стр.Параметры.Карта=Выборка.Жетон;                  
			Стр.Параметры.Марка=Выборка.МаркаАвтомобиля;
			Стр.Параметры.Въезд=Формат(Выборка.ДатаВремяВъезда,"ДЛФ=В");
			Если не ЗначениеЗаполнено(Выборка.ДатаВремяВыезда) тогда
				Стр.Параметры.Выезд="????";
				Стр.Параметры.Ожидание="????";
			Иначе 
				Стр.Параметры.Выезд=Формат(Выборка.ДатаВремяВыезда,"ДЛФ=В");
				Ож=Выборка.ДатаВремяВыезда - Выборка.ДатаВремяВъезда ;
				ЧЧ=Цел(Ож/3600);
				МИН=Цел( (Ож-ЧЧ*3600)/60) ;
				Если ЧЧ=0 тогда
					Стр.Параметры.Ожидание=Строка(МИН)+" мин.";
				Иначе 
					Стр.Параметры.Ожидание=Строка(ЧЧ)+ "ч. "+МИН+" мин.";
				КонецЕсли;
			КонецЕсли;
			
			ТД.Вывести(Стр); 
		КонецЕсли;
	КонецЦикла;
	
	// Вставить содержимое обработчика.
КонецПроцедуры
